examples/yeast_radially_symmetric_nutrient_eating_rate_adjustable_timestep/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    petri_top
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    yeast_top
    {
	type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    yeast_bottom
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    petri_bottom
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    petri_outer
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    right_sym
    {
	type 		wedge;
    }
    left_sym
    {
	type		 wedge;
    }
}

// ************************************************************************* //
