examples/yeast_radially_symmetric_nutrient_eating_rate_adjustable_timestep/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location constant;
    object transportProperties;
}

#include "../parameters"


materialName dimensionless;
Ra Ra [0 4 -2 0 -1 0 0] $Ra;
