examples/yeast_radially_symmetric_nutrient_eating_rate_adjustable_timestep/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object controlDict;
}
    startFrom latestTime;
    startTime 0;
    stopAt endTime;
    endTime 2.0;
    //*** Adjustable runtime controls ***
    writeControl adjustableRunTime;
    adjustTimeStep yes;
    maxCo 0.1;
    deltaT 0.001;
    writeInterval 0.01;

    //***
    purgeWrite 0;
    writeFormat ascii;
    writePrecision 6;
    writeCompression uncompressed;
    timeFormat general;
    timePrecision 6;
    graphFormat raw;
    runTimeModifiable true;

libs (
      "libOpenFOAM.so"
      "libsimpleSwakFunctionObjects.so"
      "libswakFunctionObjects.so"
      "libgroovyBC.so"
      "libswakSourceFields.so"
     );
