examples/yeast_radially_symmetric_nutrient_eating_rate_adjustable_timestep/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version 2.0;
	format ascii;
	class dictionary;
	location system;
	object fvSolution;
}

SIMPLE
{
    nNonOrthogonalCorrectors 0; // Our mesh is orthogonal.
    pRefCell 0;
    pRefValue 0;
    momentumPredictor on;
    residualControl
    {
        U 6.0E-5;
        p_rgh 5.0E-5;
        max_iter 500; // Maximum number of iterations attempted before giving up on calculating the flow field
    }

}

solvers
{
    p_rgh
    {
        solver GAMG;
        agglomerator faceAreaPair;
        mergeLevels 1;
        cacheAgglomeration true;
        tolerance 1e-8;
        relTol 0.01;
        smoother GaussSeidel;
    }

    U
    {
        solver GAMG;
        agglomerator faceAreaPair;
        mergeLevels 1;
        cacheAgglomeration true;
        tolerance 1e-10;
        relTol 0.1;
        smoother GaussSeidel;
    }

    c
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }
}

relaxationFactors // Same used in other examples
{
    fields
    {
        p_rgh 0.7;
    }

    equations
    {
        U 0.3;
    }

}
